
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
    // регистр ОстаткиКошельков
	Движения.ОстаткиКошельков.Записывать = Истина;
	ДвижениеКошелек = Движения.ОстаткиКошельков.ДобавитьРасход();
	ДвижениеКошелек.Период = Дата;
	ДвижениеКошелек.Кошелек = Кошелек;
	ДвижениеКошелек.Сумма = Сумма;
	// регистр ДоходыИРасходы 
	Движения.ДоходыИРасходы.Записывать = Истина;
	ДвижениеАналитика = Движения.ДоходыИРасходы.Добавить();
	ДвижениеАналитика.Период = Дата;
	ДвижениеАналитика.Статья = СтатьяРасходов;
	ДвижениеАналитика.Тип = Перечисления.ТипыДвиженияФинансов.Расход;
	ДвижениеАналитика.Кошелек = Кошелек;
	ДвижениеАналитика.Сумма = Сумма;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
