&НаСервере
Процедура ПриСозданииНаСервере()

	ЗаполнитьДиаграммы();	

КонецПроцедуры // ПриСозданииНаСервере()

&НаСервере
Процедура ЗаполнитьДиаграммы() 
	Диаграмма.Очистить();
	Диаграмма.Обновление = Ложь;
	Запрос = Новый Запрос;
	 Запрос.Текст = 
         "ВЫБРАТЬ
        |    НАЧАЛОПЕРИОДА(ОстаткиКошельковОбороты.Период, ДЕНЬ) КАК День,
        |    СУММА(ОстаткиКошельковОбороты.СуммаПриход) КАК СуммаПриход,
        |    СУММА(ОстаткиКошельковОбороты.СуммаРасход) КАК СуммаРасход
        |ИЗ
        |    РегистрНакопления.ОстаткиКошельков.Обороты(&НачалоМесяца, &ОкончаниеМесяца, День, ) КАК ОстаткиКошельковОбороты
        |СГРУППИРОВАТЬ ПО
        |    НАЧАЛОПЕРИОДА(ОстаткиКошельковОбороты.Период, ДЕНЬ)
        |УПОРЯДОЧИТЬ ПО
        |    День";               
	 
    Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(ТекущаяДата()));
    Запрос.УстановитьПараметр("ОкончаниеМесяца", КонецМесяца(ТекущаяДата()));
    
    РезультатЗапроса = Запрос.Выполнить();
    Выборка = РезультатЗапроса.Выбрать();
	
	
	СерияРасходы = Диаграмма.Серии.Добавить("Расходы");
	СерияДоходы = Диаграмма.Серии.Добавить("Доходы");

    
	Пока Выборка.Следующий() Цикл
		ИмяТочки = Формат(День(Выборка.День),"ЧГ=0");
		Точка = Диаграмма.Точки.Добавить(ИмяТочки); 
        Диаграмма.УстановитьЗначение(Точка, СерияРасходы, Выборка.СуммаРасход); 
		Диаграмма.УстановитьЗначение(Точка,СерияДоходы,Выборка.СуммаПриход);
    КонецЦикла;
    
     Диаграмма.Обновление = Истина;
КонецПроцедуры // ЗаполнитьДиаграммы()

&НаКлиенте
Процедура ДобавитьДоход(Команда)        
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияФормыДокумента", ЭтаФорма);
    
    СтруктураПараметров = Новый Структура;
    
    ОткрытьФорму("Документ.Доход.ФормаОбъекта",СтруктураПараметров,ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьРасход(Команда)
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияФормыДокумента", ЭтаФорма);
    
    СтруктураПараметров = Новый Структура;
    
    ОткрытьФорму("Документ.Расход.ФормаОбъекта",СтруктураПараметров,ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры   

&НаКлиенте
Процедура ПослеЗакрытияФормыДокумента(Результат, ДополнительныеПараметры) Экспорт
	ЗаполнитьДиаграммы();

	

КонецПроцедуры // ПослеЗакрытияФормыДокумента()

